package main

import "fmt"

// Дана последовательность температурных колебаний: -25.4, -27.0, 13.0, 19.0, 15.5, 24.5, -21.0, 32.5.
// Объединить данные значения в группы с шагом в 10 градусов. Последовательность в подмножноствах не важна.
// Пример: -20:{-25.0, -27.0, -21.0}, 10:{13.0, 19.0, 15.5}, 20: {24.5}, etc.

func main() {
	array := []float64 {-25.4, -27.0, 13.0, 19.0, 15.5, 24.5, -21.0, 32.5}
	var temp map[int][]float64 = make(map[int][]float64)

	for _, value := range array {
		v := int(value) / 10
		v = v * 10
		temp[v] = append(temp[v], value)
	}

	fmt.Println(temp)
}